BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуЗерна/ИНАГРО_ДанныеПоКачествуЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИНАГРО_ДанныеПоКачествуЗерна</name>
  <attributes>
    <name>НачальныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереключательКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьНеВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесьВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесьНеВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоВлажностиВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоВлажностиНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоСорнойПримесиВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоСорнойПримесиНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сушить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуЗерна/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	Настройки.ПараметрыДанных.Элементы.Найти("ПереключательКачества").Значение = ПереключательКачества;
	Настройки.ПараметрыДанных.Элементы.Найти("ПереключательКачества").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьВыше").Значение = ВлажностьВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьНеВыше").Значение = ВлажностьНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьВыше").Значение = СорнаяПримесьВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьНеВыше").Значение = СорнаяПримесьНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьНеВыше").Использование = Истина;

	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиВыше").Значение = ЗначениеОтбораПоВлажностиВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиНеВыше").Значение = ЗначениеОтбораПоВлажностиНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиВыше").Значение = ЗначениеОтбораПоСорнойПримесиВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиНеВыше").Значение = ЗначениеОтбораПоСорнойПримесиНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("Чистить").Значение = Чистить;
	Настройки.ПараметрыДанных.Элементы.Найти("Чистить").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("Сушить").Значение = Сушить;
	Настройки.ПараметрыДанных.Элементы.Найти("Сушить").Использование = Истина;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
